/**
 * Wiz1(FC版) 文字列データのデコード
 *
 * 濁点、半濁点は独立している場合としてない場合があるみたい。
 * 独立した文字として存在する場合は文字の上に濁点が表示される形で、
 * 独立してない場合は逆に、表示上は濁点が独立して見えるような形になるっぽい??
 *
 * $F4 も濁点、$F5 も半濁点かも
 * 表示が不自然にならないように複数用意されてる可能性あり
 *
 * $EE は potion 記号、$EF は scroll 記号
 */

#include <stdio.h>
#include <fcntl.h>
#include <io.h>

const char* const WIZ1_CHAR[0x100] = {
    "0",  "1",  "2",  "3",  "4",  "5",  "6",  "7",  "8",  "9",  "A",  "B",  "C",  "D",  "E",  "F",
    "G",  "H",  "I",  "J",  "K",  "L",  "M",  "N",  "O",  "P",  "Q",  "R",  "S",  "T",  "U",  "V",
    "W",  "X",  "Y",  "Z",  " ",  "■", "<",  ">",  "(",  ")",  "/",  "*",  "#",  "!",  "?",  "\"",
    "'",  ".",  ",",  ":",  "+",  "-",  "゜", "゛", "ア", "イ", "ウ", "エ", "オ", "カ", "キ", "ク",
    "ケ", "コ", "サ", "シ", "ス", "セ", "ソ", "タ", "チ", "ツ", "テ", "ト", "ナ", "ニ", "ヌ", "ネ",
    "ノ", "ハ", "ヒ", "フ", "ヘ", "ホ", "マ", "ミ", "ム", "メ", "モ", "ヤ", "ユ", "ヨ", "ラ", "リ",
    "ル", "レ", "ロ", "ワ", "of", "ン", "ァ", "ィ", "ェ", "ォ", "ッ", "ャ", "ュ", "ョ", "あ", "い",
    "う", "え", "お", "か", "き", "く", "け", "こ", "さ", "し", "す", "せ", "そ", "た", "ち", "つ",
    "て", "と", "な", "に", "ぬ", "ね", "の", "は", "ひ", "ふ", "へ", "ほ", "ま", "み", "む", "め",
    "も", "や", "ゆ", "よ", "ら", "り", "る", "れ", "ろ", "わ", "を", "ん", "っ", "ゃ", "ゅ", "ょ",
    "ガ", "ギ", "グ", "ゲ", "ゴ", "ザ", "ジ", "ズ", "ゼ", "ゾ", "ダ", "ヂ", "ヅ", "デ", "ド", "バ",
    "ビ", "ブ", "ベ", "ボ", "が", "ぎ", "ぐ", "げ", "ご", "ざ", "じ", "ず", "ぜ", "ぞ", "だ", "ぢ",
    "づ", "で", "ど", "ば", "び", "ぶ", "べ", "ぼ", "パ", "ピ", "プ", "ペ", "ポ", "ぱ", "ぴ", "ぷ",
    "ぺ", "ぽ", NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL,
    NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, "∀", "￡",
    NULL, NULL, NULL, NULL, "゛", "゜", NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL,
};



int main(int argc, char** argv)
{
    int ch;
    unsigned int offset = 0;
    int follow = 0;
    const char* ch_wiz1;

    setmode(fileno(stdin), O_BINARY);

    while((ch = getchar()) != EOF){
        if((ch_wiz1 = WIZ1_CHAR[ch])){
            if(!follow){
                printf("0x%04X: ", offset);
                follow = 1;
            }
            fputs(ch_wiz1, stdout);
        }
        else{
            if(follow){
                putchar('\n');
                follow = 0;
            }
        }

        ++offset;
    }

    return 0;
}
